{
  "test": [
    {
      "id": 1,
      "date": "2023-12-31T14:20:00.000Z",
      "type": "click-collect",
      "contact": "Mr John Smith",
      "itemIDs": [
        1,
        2,
        3,
        4
      ],
      "totalPrice": 22.5,
      "status": "Paid"
    },
    {
      "id": 2,
      "date": "2023-11-11T23:45:56.789Z",
      "type": "click-collect",
      "contact": "Mr Nettles Holloway",
      "itemIDs": [
        4,
        5
      ],
      "totalPrice": 10.4,
      "status": "Completed"
    },
    {
      "id": 3,
      "date": "2024-01-02T03:04:05.420Z",
      "type": "delivery",
      "contact": "Ms Joe",
      "itemIDs": [
        6,
        7,
        8
      ],
      "totalPrice": 17,
      "status": "Unpaid"
    }
  ],
  "products": [
    {
      "ID": 1,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Vicks",
      "TYPE": "Vaporub",
      "QTY": "100g",
      "SPRICE": 4.5,
      "PPRICE": 3.7,
      "STOCK": 15,
      "LIMIT": 0,
      "DETAILS": "Vicks VapoRub contains: Menthol and camphor to calm a cough, Eucalyptus and menthol to relieve nose congestion, Eucalyptus to relieve catarrh",
      "INGREDIENTS": "Turpentine oil, eucalyptus oil, levomenthol, camphor, thymol, cedarwood oil, white soft paraffin, petrolatum",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 2,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Vicks",
      "TYPE": "First Defence",
      "QTY": "15ml",
      "SPRICE": 6.8,
      "PPRICE": 5,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"When used at the first signs of a cold, First Defence nasal spray acts at the back of the nose directly where the cold virus takes hold and starts to develop(that is why it is a nasal spray). It traps, inactivates and helps your body naturally remove the cold virus, before it develops into a full blown cold.",
      "INGREDIENTS":"Aqua, Hydroxypropyl Methylcellulose (1%), Succinic Acid (1%), Disodium Succinate (0.44%), PCA (0.35%), Phenethyl Alcohol, Zinc EDTA, Zinc Acetate, Polysorbate 80, Menthol, Camphor, Sodium Saccharin, Eucalyptol.",
      "CONTRAINDICATIONS":"Avoid using in case of injury or nose bleeding" 
    },
    {
      "ID": 3,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Gsk",
      "TYPE": "Night Nurse",
      "QTY": "160ml",
      "SPRICE": 9,
      "PPRICE": 7.5,
      "STOCK": 30,
      "LIMIT": 0,
      "DETAILS":"Night Nurse Capsules have been specially formulated to provide a complete night-time cold and flu treatment by quickly providing relief from major cold and flu symptoms including: \n \n  -  Headache\n  -  Runny nose\n  -  Dry, tickly cough\n  -  Shivers, aches and pains\n  -  Sore throat pain",
      "INGREDIENTS":"Active ingredient: Each capsule contains Paracetamol 500mg, Promethazine Hydrochloride 10mg, Dextromethorphan Hydrobromide 7.5mg.\n\n  Also contains: Lactose, dimeticone, colloidal anhydrous silica, gelatin, and colours erythrosine (E127), patent blue V (E131), quinoline yellow (E104) and titanium dioxide (E171).",
      "CONTRAINDICATIONS":"Do not take: Do not take: With other flu, cold or decongestant products at night, or with alcohol.If you have liver or kidney disease. Contains paracetamol. Do not take with any other paracetamol-containing products.With other flu, cold or decongestant products at night, or with alcohol.If you have liver or kidney disease.\n\nContains paracetamol. Do not take with any other paracetamol-containing products."
    },
    {
      "ID": 4,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Lemsip",
      "TYPE": "Max",
      "QTY": "16 caps",
      "SPRICE": 4.2,
      "PPRICE": 3.7,
      "STOCK": 25,
      "LIMIT": 0,
      "DETAILS":"Effective relief for fever, headaches, body aches, blocked nose, sore throat.",
      "INGREDIENTS":"Active ingredients: (per sachet) Paracetamol 1000mg, phenylephrine hydrochloride 12.2mg. Also contains: Ascorbic acid (vitamin C), aspartame, sodium and sucrose. Total sugar content 2g",
      "CONTRAINDICATIONS": " Do not take if: you are allergic to any ingredient, if you have heart disease, high blood pressure, overactive thyroid, an enlarged prostate, or you are taking or have taken MAOIs (antidepressants) within 14 days, if you are taking other sympathomimetic decongestants, you have phaeochromocytoma. \n Do not take anything else containing paracetamol while taking this medicine."
    },
    {
      "ID": 5,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Lemsip",
      "TYPE": "Standard",
      "QTY": "10 sachets",
      "SPRICE": 4.5,
      "PPRICE": 3.5,
      "STOCK": 25,
      "LIMIT": 0,
      "DETAILS":"For relief of fever, headaches, body aches blocked nose and sore throat.",
      "INGREDIENTS":"Paracetamol and Phenylephrine hydrochloride",
      "CONTRAINDICATIONS":" Do not take with any other paracetamol-containing products.\n\n DO NOT TAKE IF: allergic to any of the ingredients, if you have heart disease or high blood pressure. " 
    },
    {
      "ID": 6,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Sudafed",
      "TYPE": "Day and Night",
      "QTY": "16 caps",
      "SPRICE": 4.5,
      "PPRICE": 3.2,
      "STOCK": 30,
      "LIMIT": 1,
      "DETAILS":"Sudafed Congestion & Headache Relief Day & Night Capsules with Phenylephrine hydrochloride, Caffeine and Paracetamol, help relieve the symptoms of colds and flu, including stuffy noses, headache, sore throat, fever, aches and pains. The Day capsules can also relieve tiredness and drowsiness.",
      "INGREDIENTS":"Paracetamol, Caffeine, Phenylephrine Hydrochloride",
      "CONTRAINDICATIONS": "Do not take anything else containing paracetamol while taking this medicine."
    },
    {
      "ID": 7,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Sudafed",
      "TYPE": "Max",
      "QTY": "16 caps",
      "SPRICE": 4.2,
      "PPRICE": 3.2,
      "STOCK": 30,
      "LIMIT": 1,
      "DETAILS":"Sudafed Sinus Max Strength Capsules with Phenylephrine hydrochloride, Caffeine and Paracetamol, help relieve the symptoms of pain and congestion caused by sinusitis, which include stuffy nose, blocked sinuses, headache, fever, aches and pains. The capsules can also relieve tiredness and drowsiness.",
      "INGREDIENTS":"Paracetamol, Caffeine, Phenylephrine Hydrochloride",
      "CONTRAINDICATIONS": " Do not take anything else containing paracetamol while taking this medicine."
    },
    {
      "ID": 8,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Benylin",
      "TYPE": "Mucus relief",
      "QTY": "16 caps",
      "SPRICE": 4.8,
      "PPRICE": 3.2,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"Benylin Mucus Cough Max Honey & Lemon Flavour 100 mg/5 ml Syrup helps to relieve chesty (productive) coughs by thinning and loosening chest mucus (phlegm), making it easier to cough up.",
      "INGREDIENTS":"Guaifenesin. Also contains: Ethanol, glucose and sucrose ",
      "CONTRAINDICATIONS": "As with all similar medicines, if you are pregnant or breast-feeding, consult your doctor or pharmacist before taking this product."
    },
    {
      "ID": 9,
      "CATEGORY": "Cold and Flu",
      "BRAND": "Benylin",
      "TYPE": "4 flu",
      "QTY": "24 caps",
      "SPRICE": 6,
      "PPRICE": 4.9,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"BENYLIN® 4 Flu Tablets provide effective relief from flu symptoms including fever, congestion, and aches and pains.",
      "INGREDIENTS":" Paracetamol, diphenhydramine hydrochloride, pseudoephedrine hydrochloride",
      "CONTRAINDICATIONS": " If you are taking medicines for high blood pressure you should not take Benylin 4 flu."
    },
    {
      "ID": 10,
      "CATEGORY": "Skincare",
      "BRAND": "E45",
      "TYPE": "Psoriasis cream",
      "QTY": "50ml",
      "SPRICE": 20,
      "PPRICE": 16,
      "STOCK": 15,
      "LIMIT": 0,
      "DETAILS":"Cream for treatment and prevention of psoriasis and dermatitis symptoms. Scientifically proven to treat symptoms of psoriasis. Reduces scaling, itching, redness, roughness & hardening of the skin. Steroid free. Suitable for long-term use",
      "INGREDIENTS":"Ectoin®, Aqua, Cetearyl Alcohol, Urea, Cetearyl Isononanoate, Glycerin, Simmondsia Chinensis Seed Oil, Hydrogenated Polydecene, Pentylene Glycol, Hydroxyethyl Urea, Panthenol, Cetearyl Glucoside, Lecithin, Allantoin, Xanthan Gum, Ethylhexylglycerin, Sodium Lactate, Sodium Cetearyl Sulfate, Triacetin",
      "CONTRAINDICATIONS": "Do not use on infected skin. "
    },
    {
      "ID": 11,
      "CATEGORY": "Skincare",
      "BRAND": "Eurax",
      "TYPE": "Skin cream",
      "QTY": "100g",
      "SPRICE": 5.7,
      "PPRICE": 4.2,
      "STOCK": 15,
      "LIMIT": 0,
      "DETAILS":"A non-greasy, non-staining cream for the relief of itching and skin irritation caused by:\n - Itchy dermatitis \n - Dry eczema \n - Allergic rashes \n - Hives, nettle rashes\n - Chickenpox \n - Insect bites & stings\n - Heat rashes \n - Sunburn \n - Personal itching",
      "INGREDIENTS":"Active ingredients \n Crotamiton \n Also contains: Methyl hydroxybenzoate E218, phenylethyl alcohol, glycerol, triethanolamine, sodium lauryl sulphate, ethylene glycol monostearate, stearyl alcohol, strong ammonia solution, stearic acid, hard paraffin, white beeswax, purified water and Perfume contains: geraniol, citronellol, coumarin, benzyl alcohol (0.0187%), benzyl benzoate (0.0047%), citral, d-limonene, eugenol, linalool.",
      "CONTRAINDICATIONS": "Eurax Cream is not recommended in pregnancy."
    },
    {
      "ID": 12,
      "CATEGORY": "Skincare",
      "BRAND": "Eucerin",
      "TYPE": "Skin relief cream",
      "QTY": "50ml",
      "SPRICE": 9,
      "PPRICE": 7,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"Natural oatmeal relieves dry, itchy, irritated skin of eczema. Ceramide-3 and Licochalcone enriched formula strengthens the skins barrier and soothes red, irritated skin. Appropriate for adults, children and babies 3 months and older, gentle enough for everyday use.",
      "INGREDIENTS":"Ceramide-3 and Licochalcone",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 13,
      "CATEGORY": "Skincare",
      "BRAND": "Eucerin",
      "TYPE": "Face scrub",
      "QTY": "100ml",
      "SPRICE": 7.5,
      "PPRICE": 6,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"he Eucerin DermoPurifyer Oil Control Scrub is an oil-free skin peel which uses Lactic Acid to help remove impurities without drying out the skin. Suitable for face and body, the exfoliating action of natural micro particles works against dead skin cells, one of the key causes of blackheads and spots, and gently cleanses skin and removes makeup. \n Pores are unclogged, impurities and blackheads are reduced and skin texture is visibly smooth and refined. \n The product has been specially formulated for oily and blemish-prone skin which is not undergoing medication and can be used during pregnancy. \n Clinical studies to prove the effectiveness of the scrub had the following findings: \n - A positive effect on general skin condition \n- Well tolerated by those with blemish and acne-prone skin \n- antibacterial \n- comedolytic \n- non-comedogenic\n - lightly fragranced",
      "INGREDIENTS":"Aqua, Coco Glucoside, Coco-Betaine, Microcrystalline Cellulose, Acrylates-C10-30-Alkyl-Acrylate-Crosspolymer, Lactic Acid, Sodium Chloride, Sodium Hydroxide, Cellulose, Mannitol, Polyquaternium-10, Sodium Benzoate, Phenoxyethanol, Benzophenone-4, Parfum, CI 77289",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 14,
      "CATEGORY": "Skincare",
      "BRAND": "Dermalex",
      "TYPE": "Psoriasis cream",
      "QTY": "150ml",
      "SPRICE": 30,
      "PPRICE": 25,
      "STOCK": 10,
      "LIMIT": 0,
      "DETAILS":"An effective and skin-friendly cream for the treatment of mild and moderate psoriasis. \nHelps to reduce itching and scaling, moisturises and helps to restore the skin barrier. Normalises skin cell production while supporting the skins own repair mechanism to strengthen and restore the skin barrier and replenish moisture levels. \n - Does not contain steroids \n - Appropriate for long-term use \n - Clinically-proven efficacy \n - This product is a medical device",
      "INGREDIENTS":"Purified water, White Petrolatum, Cetearyl alcohol, Paraffinum liquidum, Polysorbatum 60, Ethyl alcohol, Methyl 4-hydroxybenzoate, Modified alumino-silicates + alkaline earth minerals (refered to as MagneoLite Complex) optimised for Psoriasis treatment.",
      "CONTRAINDICATIONS": "Do not use on severe open wounds."
    },
    {
      "ID": 15,
      "CATEGORY": "Skincare",
      "BRAND": "Dermalex",
      "TYPE": "Repair and Restore",
      "QTY": "100g",
      "SPRICE": 12,
      "PPRICE": 10,
      "STOCK": 10,
      "LIMIT": 0,
      "DETAILS":"A breakthrough skin strengthening cream recommended by Nordic Dermatologists for dry to atopic skin. Hydrates and strengthens the skin so well, it even prevents the relapse of eczema. \n - Proven to intensely hydrate and strengthen the skin barrier \n - Supported by 20 years of research and over 20 scientific publications \n - Soothes and softens the skin \n - Protects the skin to help prevent future dryness \n - Hydrates and strengthens so well it even helps to prevent the relapse of eczema \n - Fragrance free \n - This product is a medical device",
      "INGREDIENTS":"Aqua, Caprylic/Capric Triglyceride, Canola Oil, Urea, Propylene Glycol, Cetearyl Alcohol, Glycerin, Dimethicone, Paraffin, Sodium Lactate, Polysorbate 60, Glyceryl Stearate, PEG-100 Stearate, Glyceryl Acrylate/Acrylic Acid Copolymer, Carbomer, Lactic Acid, Critric Acid, Ethylparaben, Methylparaben.",
      "CONTRAINDICATIONS": "Avoid applying to open wounds, intimate areas, inside the mouth or near the eyes, nose or ears."
    },
    {
      "ID": 16,
      "CATEGORY": "Skincare",
      "BRAND": "Dermalex",
      "TYPE": "Eczema cream",
      "QTY": "30g",
      "SPRICE": 12,
      "PPRICE": 9.7,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"An effective treatment for the most common type of eczema. This rich, non-greasy cream is clinically proven to intensely hydrate the skin while replenishing moisture levels. It also supports the skin’s own repair mechanism to strengthen and restore the skin barrier, leaving it stronger, smoother and more supple. \n - No steroids \n - Appropriate for long-term use \n - Safe to use on the face \n - This product is a medical device",
      "INGREDIENTS":"Skin Identical Ceramide complex, Purified water, Glycerol, Glyceryl Stearate, Cocoglycerides, Cetyl Alcohol, Isopropyl Myrisate, Ceteareth-20, Ceteareth-12, Cetearyl Alcohol, Cetyl Palmitate, Dehydroacetic Acid, Benzyl Alcohol, Modified alumino-silicates + alkaline earth minerals (referred to as MagneoliteTM Complex) optimised for atopic eczema treatment.",
      "CONTRAINDICATIONS": "Do not use on severe open wounds."
    },
    {
      "ID": 17,
      "CATEGORY": "Skincare",
      "BRAND": "Dermalex",
      "TYPE": "Eczema cream",
      "QTY": "100g",
      "SPRICE": 25,
      "PPRICE": 22.2,
      "STOCK": 5,
      "LIMIT": 0,
      "DETAILS":"An effective treatment for the most common type of eczema. This rich, non-greasy cream is clinically proven to intensely hydrate the skin while replenishing moisture levels. It also supports the skin’s own repair mechanism to strengthen and restore the skin barrier, leaving it stronger, smoother and more supple. \n - No steroids \n - Appropriate for long-term use \n - Safe to use on the face \n - This product is a medical device",
      "INGREDIENTS":"Skin Identical Ceramide complex, Purified water, Glycerol, Glyceryl Stearate, Cocoglycerides, Cetyl Alcohol, Isopropyl Myrisate, Ceteareth-20, Ceteareth-12, Cetearyl Alcohol, Cetyl Palmitate, Dehydroacetic Acid, Benzyl Alcohol, Modified alumino-silicates + alkaline earth minerals (referred to as MagneoliteTM Complex) optimised for atopic eczema treatment.",
      "CONTRAINDICATIONS": "Do not use on severe open wounds."
    },
    {
      "ID": 18,
      "CATEGORY": "Skincare",
      "BRAND": "Cetaphil",
      "TYPE": "Moisturising cream",
      "QTY": "50ml",
      "SPRICE": 10,
      "PPRICE": 7.6,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS":"Cetaphil Moisturising Cream is a rich face and body moisturiser for dry to very dry sensitive skin. It’s clinically proven to nourish and hydrate skin in just 1 day and helps to restore the skins natural moisture barrier in 1 week for immediate and long lasting relief. \n This replenishing, hydrating moisturiser with Sweet Almond Oil, Niacinamide (Vitamin B3), Panthenol (Pro-Vitamin B5) and Vitamin E provides 48 hour hydration and leaves skin feeling smooth, soft and comfortable. Defends against 5 signs of skin sensitivity – dryness, irritation, roughness, tightness and a weakened skin barrier. \n Key benefits \n - Dermatologically tested \n - No added fragrance \n - Does not clog pores \n - Vegan",
      "INGREDIENTS":"Aqua, Glycerin, Petrolatum, Dicaprylyl Ether, Dimethicone, Glyceryl Stearate, Cetyl Alcohol, Helianthus Annuus Seed Oil, PEG-30 Stearate, Panthenol, Niacinamide, Prunus Amygdalus Dulcis Oil, Tocopherol, Tocopheryl Acetate, Pantolactone, Dimethiconol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Carbomer, Propylene Glycol, BHT, Disodium EDTA, Benzyl Alcohol, Phenoxyethanol, Sodium Hydroxide, Citric Acid ",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 19,
      "CATEGORY": "Skincare",
      "BRAND": "Cetaphil",
      "TYPE": "Exfoliating cleanser",
      "QTY": "180ml",
      "SPRICE": 12,
      "PPRICE": 10.1,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Cetaphil Gentle Exfoliating Cleanser is a daily face wash with a gentle exfoliating action, designed for dry, oily or combination skin. It helps to renew and smooth your skin by removing dead skin cells and daily impurities. \nFormulated with Bamboo Extract, Panthenol (Pro-Vitamin B5) and Vitamin E, this light scrub gently exfoliates to reveal radiant-looking skin without clogging pores or over-drying the skin. It’s gentle enough to be used daily for all skin types. \nDefends against 5 signs of skin sensitivity – dryness, irritation, roughness, tightness and a weakened skin barrier. \nKey benefits\n - Dermatologically tested \n - Maintains skins pH \n - Does not clog pores \n - Vegan",
      "INGREDIENTS": "Aqua, Cocamidopropyl Betaine, Disodium Cocoamphodiacetate, Glycerin, Coco-Glucoside, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Bambusa Arundinacea Stem Extract, Citric Acid, Heliotropine, Panthenol, Parfum, Phenoxyethanol, Polyquaternium-10, Sodium Benzoate, Sodium Chloride, Sodium Citrate, Sodium Cocoamphoacetate, Sodium Hydroxide, Tocopheryl Acetate, Xanthan Gum",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 20,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Nurofen",
      "TYPE": "Meltlets",
      "QTY": "16 caps",
      "SPRICE": 4,
      "PPRICE": 3.7,
      "STOCK": 40,
      "LIMIT": 0,
      "DETAILS": " FOR RELIEF FROM:\n - Headache \n - Feverishness \n - Muscular pain \n - Cold & flu symptoms \n - Period pain \n - Migraine \n - Rheumatic pain \n - Dental pain \n - Backache \n - Neuralgia",
      "INGREDIENTS":"Each tablet contains: Ibuprofen 200mg.",
      "CONTRAINDICATIONS": "DO NOT TAKE IF YOU: \n - Have (or have had two or more episodes of) a stomach ulcer, perforation or bleeding \n - Are allergic to ibuprofen or any other ingredient of the product, aspirin or other related painkillers \n - Are taking other NSAID painkillers, or aspirin with a daily dose above 75mg \n - Are in the last 3 months of pregnancy"
    },
    {
      "ID": 21,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Nurofen",
      "TYPE": "Express",
      "QTY": "16 caps",
      "SPRICE": 4,
      "PPRICE": 3.5,
      "STOCK": 30,
      "LIMIT": 0,
      "DETAILS": " FOR RELIEF FROM:\n - Headache \n - Feverishness \n - Muscular pain \n - Cold & flu symptoms \n - Period pain \n - Migraine \n - Rheumatic pain \n - Dental pain \n - Backache \n - Neuralgia",
      "INGREDIENTS":"Active ingredients: Each caplet contains Sodium Ibuprofen 256mg (equivalent to Ibuprofen 200mg)\n Also contains: sucrose.",
      "CONTRAINDICATIONS": "DO NOT TAKE IF YOU: \n - Have (or have had two or more episodes of) a stomach ulcer, perforation or bleeding \n - Are allergic to ibuprofen or any other ingredient of the product, aspirin or other related painkillers \n - Are taking other NSAID painkillers, or aspirin with a daily dose above 75mg \n - Are in the last 3 months of pregnancy"
    },
    {
      "ID": 22,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Nurofen",
      "TYPE": "Max strength",
      "QTY": "32 caps",
      "SPRICE": 7,
      "PPRICE": 6.2,
      "STOCK": 25,
      "LIMIT": 0,
      "DETAILS": " FOR RELIEF FROM:\n - Headache \n - Feverishness \n - Muscular pain \n - Cold & flu symptoms \n - Period pain \n - Migraine \n - Rheumatic pain \n - Dental pain \n - Backache \n - Neuralgia \n - Dental pain \n - Muscular pain \n - Feverishness \n - Cold and flu symptoms \n - Sore throat \n -Non serious Arthritis pain",
      "INGREDIENTS": "Active ingredients: each tablet contains Sodium Ibuprofen 512mg (equivalent to Ibuprofen 400mg). \n Also contains: Sucrose.",
      "CONTRAINDICATIONS": "DO NOT TAKE IF YOU: \n - Have (or have had two or more episodes of) a stomach ulcer, perforation or bleeding \n - Are allergic to ibuprofen or any other ingredient of the product, aspirin or other related painkillers \n - Are taking other NSAID painkillers, or aspirin with a daily dose above 75mg \n - Are in the last 3 months of pregnancy"
    },
    {
      "ID": 23,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Nurofen",
      "TYPE": "Standard",
      "QTY": "16 caps",
      "SPRICE": 4,
      "PPRICE": 3.2,
      "STOCK": 30,
      "LIMIT": 0,
      "DETAILS":" FOR RELIEF FROM:\n - Migraine/headache \n - Feverishness \n - Muscular pain \n - Cold & flu symptoms \n - Period pain \n - Rheumatic pain \n - Dental pain \n - Backache \n - Neuralgia",
      "INGREDIENTS":"Active ingredients: Each tablet contains Ibuprofen 200mg and about 12.7mg of sodium. \n Also contains: Sucrose. ",
      "CONTRAINDICATIONS": "DO NOT TAKE IF YOU: \n - Have (or have had two or more episodes of) a stomach ulcer, perforation or bleeding \n - Are allergic to ibuprofen or any other ingredient of the product, aspirin or other related painkillers \n - Are taking other NSAID painkillers, or aspirin with a daily dose above 75mg \n - Are in the last 3 months of pregnancy"
    },
    {
      "ID": 24,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Cuprofen ",
      "TYPE": "Max strength",
      "QTY": "96 caps",
      "SPRICE": 11,
      "PPRICE": 9,
      "STOCK": 20,
      "LIMIT": 1,
      "DETAILS": "Cuprofen maximum strength tablets provide fasting acting, powerful relief from pain caused by a toothache, headaches, period pains and much more. Cuprofen can also give effective relief from colds and flu in just one tablet.",
      "INGREDIENTS":"Active ingredients: Each tablet contains Ibuprofen 400mg. ",
      "CONTRAINDICATIONS": "Cuprofen should however not be taken alongside other NSAIDs such as: \n - Ibuprofen containing medication \n - Naproxen \n - Diclofenac \n - High-doses of aspirin"
    },
    {
      "ID": 25,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Solpadeine",
      "TYPE": "Headache",
      "QTY": "16 caps",
      "SPRICE": 2,
      "PPRICE": 1.6,
      "STOCK": 20,
      "LIMIT": 1,
      "DETAILS":"Solpadeine Headache Soluble Tablets contain a dual action formula of Paracetamol and Caffeine for fast and effective pain relief. The soluble tablets get to work 2x faster than Paracetamol alone. \n - PARACETAMOL relieves your pain symptoms \n - CAFFEINE helps speed up the absorption of Paracetamol \n Solpadeine Headache Soluble Tablets are suitable for headaches, migraine, backache, toothache, rheumatic pain and dysmenorrhoea (period pain), and relief of the symptoms of colds, flu, and sore throats.",
      "INGREDIENTS": "Active Ingredients: Each effervescent tablet contains the active ingredients Paracetamol 500mg, Caffeine 65mg. \n Also contains: Sorbitol (E420).",
      "CONTRAINDICATIONS": " Do not take with any other paracetamol-containing products. \n Avoid too much caffeine in drinks like coffee and tea when taking these tablets."
    },
    {
      "ID": 26,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Anadin",
      "TYPE": "Extra",
      "QTY": "16 caps",
      "SPRICE": 2.3,
      "PPRICE": 2,
      "STOCK": 30,
      "LIMIT": 1,
      "DETAILS": "Anadin Extra. For relief from: \n - Headache \n - Migraine \n - Period Pain \n - Back Pain \n - Muscle ache & pain \n - Rheumatic pain \n - Fever \n - Toothache \n - Cold & flu symptoms \n Also provides relief from: lower back pain, stiffness, siatica, sprains, strains, joint swelling, neuralgia, fibrositis and a sore throat.",
      "INGREDIENTS": "Active Ingredients: Aspirin 300mg, Paracetamol 200mg and Caffeine 45mg. \n Also Contains: maize starch, microcrystalline cellulose (E460), hydrogenated vegetable oil, hydroxypropyl methylcellulose (E646), polyethylene glycol, pregelatinised starch and povidone.",
      "CONTRAINDICATIONS": "Do not take anything else containing paracetamol while taking this medicine."
    },
    {
      "ID": 27,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Anadin",
      "TYPE": "Triple action",
      "QTY": "12 caps",
      "SPRICE": 2,
      "PPRICE": 1.9,
      "STOCK": 30,
      "LIMIT": 1,
      "DETAILS": "For relief from: headache, migraine, period pain, back pain, muscle ache & pain, rheumatic pain, fever, toothache, cold & flu symptoms. \n Also provides relief from: lower back pain, stiffness, sciatica, sprains, strains, joint swelling, neuralgia, fibrositis and a sore throat.",
      "INGREDIENTS": " Each film-coated tablet contains: Aspirin 300mg, Paracetamol 200mg and Caffeine 45mg.",
      "CONTRAINDICATIONS": "Do not take anything else containing paracetamol while taking this medicine."
    },
    {
      "ID": 28,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Anadin",
      "TYPE": "Original",
      "QTY": "16 caps",
      "SPRICE": 1.8,
      "PPRICE": 1.5,
      "STOCK": 30,
      "LIMIT": 1,
      "DETAILS": "Anadin Original Pain Relief Tablets 12 Pack is a dual action formula containing aspirin and caffeine to provide fast and effective relief from headaches and migraines. It also helps to reduce joint swelling, neuralgia, feverishness, stiffness, sciatica, lumbago, fibrositis, sore throat, and rheumatic pain.",
      "INGREDIENTS": "Each caplet contains 325mg of aspirin and 15mg of caffeine.",
      "CONTRAINDICATIONS": "Anadin Original is not suitable for those who have: \n - Stomach ulcers, perforation, or bleeding \n - Haemophilia (blood that does not clot well) \n - Gout \n - Late-stage pregnancy or are breastfeeding \n - Asthma \n - Dehydration \n - Allergic disease \n - Liver or kidney problems \n - G-6-PD deficiency (a hereditary condition leading to low red blood cell counts)"
    },
    {
      "ID": 29,
      "CATEGORY": "Headaches and pain relief",
      "BRAND": "Disprin",
      "TYPE": "Soluble",
      "QTY": "32 tablets",
      "SPRICE": 3.6,
      "PPRICE": 2.8,
      "STOCK": 20,
      "LIMIT": 1,
      "DETAILS": "Disprin Soluble Tablets are used for fast and effective pain relief associated with headaches, migraines, toothaches, period pain, and sore throats. It can also be used to reduce temperature and inflammation in rheumatic pain.",
      "INGREDIENTS": "Active Ingredients: Aspirin 300 mg. \n Other ingredients: Each tablet contains Aspirin PH Eur 300mg, Calcium carbonate, Maize starch, Citric acid anhydrous, Talc, Sodium lauryl sulphate, Saccharin, Crospovidone and Lime flavour.",
      "CONTRAINDICATIONS": "Do not take if you have, or have ever had, a stomach ulcer or haemophilia."
    },
    {
      "ID": 30,
      "CATEGORY": "Digestion",
      "BRAND": "Dioralyte",
      "TYPE": "Blackcurrant",
      "QTY": "12 sachets",
      "SPRICE": 8,
      "PPRICE": 7.3,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Dioralyte Relief Blackcurrant is recommended for the replacement of essential body water and salts in the treatment of acute diarrhoea. \n During diarrhoea the body loses water and salts and Dioralyte Relief Blackcurrant replaces these whilst at the sametime helping watery stools return to normal more rapidly. Early use is important to avoid dehydration, especially inthe young and elderly.",
      "INGREDIENTS": "Active Ingredients: Each Sachet Contains Pre-Cooked Rice Powder 6G, Sodium Citrate 580Mg, Sodium Chloride 350Mg And Potassium Chloride 300Mg. \n Also Contains: Aspartame, Hypromellose, Blackcurrant  Avour And Ethanol.",
      "CONTRAINDICATIONS": "If you suffer from phenylketonuria you should not use Dioralyte Relief Blackcurrant. If you are suffering from intestinal obstruction, kidney or liver disease, or a condition where your body salts are disturbed or you are on a low potassium or sodium diet ask your doctor before using Dioralyte Relief Blackcurrant."
    },
    {
      "ID": 31,
      "CATEGORY": "Digestion",
      "BRAND": "Dioralyte",
      "TYPE": "Lemon",
      "QTY": "12 sachets",
      "SPRICE": 8,
      "PPRICE": 7.3,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Dioralyte is indicated for the replacement of essential body water and salts in the treatment of acute diarrhoea in infants, children and adults. Early use is important to avoid dehydration, particularly in the young and elderly. \n Dioralyte contains glucose and salts (these are Sodium chloride, Potassium chloride and Disodium hydrogen citrate). The powder is mixed with water before taking.",
      "INGREDIENTS": "Active Ingredients: Each sachet contains Sodium Chloride 0.47g, Potassium Chloride 0.30g, Glucose 3.56g, Disodium Hydrogen Citrate 0.53g. \n Also contains: Silicon dioxide, Saccharin Sodium, Citrus flavour (Lemon and lime).",
      "CONTRAINDICATIONS": "If you are suffering from intestinal obstruction, diabetes, kidney or liver failure, or are on a low potassium or sodium diet, ask your doctor or pharmacist before using Dioralyte. \n Do not use more or less than 200 ml of water. If you do, the drink will become too weak or too strong. It will not work as well. You may also upset the balance of salts in your body."
    },
    {
      "ID": 32,
      "CATEGORY": "Digestion",
      "BRAND": "Gaviscon",
      "TYPE": "Chewable",
      "QTY": "24 tablets",
      "SPRICE": 4.2,
      "PPRICE": 3.5,
      "STOCK": 25,
      "LIMIT": 0,
      "DETAILS": "Gaviscon Peppermint Flavour Tablets bring relief from the pain and discomfort of heartburn and acid indigestion, which for example, can occur after meals or during pregnancy. This product belongs to a group of medicines called \"reflux suppressants\", which form a protective layer on top of the stomach contents to prevent stomach acid escaping from the stomach where it works into the food pipe causing pain and discomfort.",
      "INGREDIENTS": "Each Chewable Tablet contains 250mg Sodium Alginate, 133.5mg Sodium Hydrogen Carbonate and 80mg Calcium Carbonate",
      "CONTRAINDICATIONS": "Contains sodium and calcium. If you have been advised to follow a diet restricted in either of these salts please consult your doctor before taking this product. \n If you have phenylketonuria, note that this product is sweetened with aspartame (E951), a source of phenylalanine."
    },
    {
      "ID": 33,
      "CATEGORY": "Digestion",
      "BRAND": "Senokot",
      "TYPE": "Max",
      "QTY": "10 tablets",
      "SPRICE": 3,
      "PPRICE": 2.7,
      "STOCK": 10,
      "LIMIT": 0,
      "DETAILS": "Senokot Max Strength Tablets Adult is an effective laxative made with natural Senna Fruit (pods), standardised to contain a constant amount of active ingredient in each dose. For the short-term relief of occasional constipation. Laxatives do not affect the number of calories absorbed from food. This means they do not help with weight loss.",
      "INGREDIENTS": "Active ingredient: Each tablet contains powdered Alexandrian Senna fruit (pods) (Cassia senna L. (C. acutifolia Delile)), and Tinnevelly Senna fruit (pods) (Cassia angustifolia Vahl) equivalent to 15mg hydroxyahthracene glycosides, calculated as senoise B. \n Also contains: Lactose.",
      "CONTRAINDICATIONS": "Do not take this product if you: \n - are allergic to any of the ingredients \n - have bowel or stomach problems \n - are pregnant or breast-feeding \n - have a kidney or heart condition \n - are under 18 years of age"
    },
    {
      "ID": 34,
      "CATEGORY": "Digestion",
      "BRAND": "Gaviscon",
      "TYPE": "Advance",
      "QTY": "300ml",
      "SPRICE": 10,
      "PPRICE": 8.1,
      "STOCK": 10,
      "LIMIT": 0,
      "DETAILS": "Extra Strenght Formula - Gaviscon Advance has double the concentration of sodium alginate of Gaviscon Original so that it forms a strong and resilient raft. This raft forms a protective barrier over the stomach contents to help soothe the burning sensation in your chest.\n Gets to Work Instantly - Gaviscon Advance formulation gets to work in seconds to create a protective barrier that lasts up to 4 hours.",
      "INGREDIENTS": "Active ingredients: Each 10 ml contains sodium alginate 1000 mg and potassium hydrogen carbonate 200 mg \n Also contains: sodium, potassium, calcium, methyl (E218) and propyl (E216) para-hydroxybenzoates.",
      "CONTRAINDICATIONS": "Do not take this product if you: \n - are allergic to any of the ingredients \n - have bowel or stomach problems \n - are pregnant or breast-feeding \n - have a kidney or heart condition \n - are under 18 years of age"
    },
    {
      "ID": 35,
      "CATEGORY": "Allergy",
      "BRAND": "Benadryl",
      "TYPE": "Relief",
      "QTY": "24 caps",
      "SPRICE": 9,
      "PPRICE": 7.1,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Active in 15 minutes on skin allergies lasts 8 hours \n Works to relieve the symptoms of hay fever and other allergic conditions such as pet, skin or dust allergies. \n These symptoms include: \n - Itchy, runny nose \n - Itchy, watery eyes \n - Sneezing \n - Urticaria (hives & itchy skin rash)",
      "INGREDIENTS": "Each capsule contains: Acrivastine 8 mg. The capsules also contain lactose.",
      "CONTRAINDICATIONS": "Consult your doctor or pharmacist if you have an underlying medical condition, are taking any other medication or complementary therapy, or if symptoms persist \n Seek advice before using if you are pregnant, planning to become pregnant, breastfeeding or suffer from allergies"
    },
    {
      "ID": 36,
      "CATEGORY": "Allergy",
      "BRAND": "Piriteze",
      "TYPE": "tabs",
      "QTY": "7 tablets",
      "SPRICE": 3,
      "PPRICE": 2.3,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Relief from the symptoms of: \n - Hayfever \n - Skin Allergies \n - Pet Allergies \n - Mould Spore Allergies \n - House Dust Mite Allergies",
      "INGREDIENTS": "Active Ingredients: Each tablet contains cetirizine hydrochloride 10mg. \n Also contains: lactose - see leaflet for further advice.",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 37,
      "CATEGORY": "Allergy",
      "BRAND": "Beconase",
      "TYPE": "Relief",
      "QTY": "100 sprays",
      "SPRICE": 6,
      "PPRICE": 4,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Beconase hayfever Relief nasal spray for adults is a highly effective medication for treating hay fever. Unlike tablets, it works right where the problem starts, in the nose. It contains belcometasone and has an anti-inflammatory action which quickly starts to reduce inflammation and swelling in the nose. The product brings relief from allergy symptoms such as: Nasal congestion, watery eyes, runny nose, sneezing, itchy eyes, itchy nose, red eyes and sinus discomfort. \n For optimum results, Beconase should be sprayed twice into each nostril every morning and night. \n Can provide up to 24hr relief (when used twice daily) from the 8 symptoms of hay fever \n - Sneezing \n - Itchy nose \n - Runny nose \n - Red eyes \n - Itchy eyes \n - Watery eyes \n - Sinus discomfort \n - Nasal decongestion \n All day and all night relief. Non-drowsy.",
      "INGREDIENTS": "Active ingredients: Contains 50 micrograms Beclometasone Dipropionate per spray \n Also contains: Microcrystalline Cellulose, Sodium Carboxymethylcellulose, Dextrose, Polysorbate 80, Purified Water, Preservatives: Benzalkonium Chloride, Phenylethylalcohol",
      "CONTRAINDICATIONS": "Consult your doctor or pharmacist if you have an underlying medical condition, are taking any other medication or complementary therapy, or if symptoms persist \n Seek advice before using if you are pregnant, planning to become pregnant, breastfeeding or suffer from allergies"
    },
    {
      "ID": 38,
      "CATEGORY": "First aid",
      "BRAND": "Dettol",
      "TYPE": "Antiseptic",
      "QTY": "500ml",
      "SPRICE": 3.2,
      "PPRICE": 3,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Dettol Liquid is an effective concentrated antiseptic solution that kills bacteria and protects against the germs which can cause infection and illness. It can be used for antiseptic cleansing of minor wounds caused by cuts, bites, grazes, insect stings; for dandruff, spots and pimples and if medically advised, for personal hygiene.",
      "INGREDIENTS": "Active ingredients: Dettol liquid contains Chloroxylenol 4.8% w/v as the active substance. \n Also contains: Pine oil, Isopropyl alcohol, Caramel, Water and Caustic Soda Solution.",
      "CONTRAINDICATIONS": "Do not use Dettol Liquid: \n - On eczema or similar dry skin conditions \n - If you are allergic to Chloroxylenol or any of the other ingredients"
    },
    {
      "ID": 39,
      "CATEGORY": "First aid",
      "BRAND": "Dettol",
      "TYPE": "Hand sanitizer",
      "QTY": "500ml",
      "SPRICE": 7,
      "PPRICE": 6.3,
      "STOCK": 50,
      "LIMIT": 0,
      "DETAILS": "KILLS 99.9 Percent OF BACTERIA and VIRUSES – Simple, fast and effective, Dettol Instant Hand Sanitiser helps you travel with confidence.",
      "INGREDIENTS": "Per 100g Of Product Contains 67.45g Ethanol",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 40,
      "CATEGORY": "First aid",
      "BRAND": "Elastoplast",
      "TYPE": "plasters",
      "QTY": "20 plasters",
      "SPRICE": 3,
      "PPRICE": 2,
      "STOCK": 30,
      "LIMIT": 0,
      "DETAILS": "Elastoplast Flexible XL plasters offer a larger size and surface area for better wound coverage. \n Made from a breathable material that flexes with movement, these plasters are best suited to knees and elbows, helping to protect wounds and prevent contamination. \n The non-stick wound pad helps to protect and cushion the wound, whilst a strong adhesive ensures that the plaster stays in place.",
      "INGREDIENTS": "",
      "CONTRAINDICATIONS": "None known"
    },
    {
      "ID": 41,
      "CATEGORY": "First aid",
      "BRAND": "TCP",
      "TYPE": "Liquid",
      "QTY": "200ml",
      "SPRICE": 4,
      "PPRICE": 3.2,
      "STOCK": 20,
      "LIMIT": 0,
      "DETAILS": "Soothes pain, fights infection. For sore throats, mouth ulcers, cuts, grazes, bites, stings & spots.",
      "INGREDIENTS": "Active ingredients: Halogenated phenols 0.68% w/v and Phenol 0.175% w/v. \n Also contains: Glycerol, concentrated phosphoric acid, E104 (quinoline yellow), water.",
      "CONTRAINDICATIONS": "Consult your doctor or pharmacist if you have an underlying medical condition, are taking any other medication or complementary therapy, or if symptoms persist \n Seek advice before using if you are pregnant, planning to become pregnant, breastfeeding or suffer from allergies"
    }
  ],
  "customerOrderRecords": [
    {
      "email": "customer@email.com",
      "firstName": "Dummy",
      "lastName": "Customer",
      "address": "South Kensington",
      "city": "London",
      "postcode": "SW7 2AZ",
      "phoneNumber": "1234567890",
      "cardName": "Customer",
      "cardNumber": "87654321",
      "expiryMonth": "12",
      "expiryYear": "24",
      "securityCode": "319",
      "date": "2024-01-05T00:18:37.364Z",
      "isDelivery": true,
      "status": "Completed",
      "totalCost": 0,
      "quantities": {"1": 0},
      "id": 0
    },
    {
      "email": "johnsmith@email.com",
      "firstName": "John",
      "lastName": "Smith",
      "address": "Flat 3, 33 Brick Lane",
      "city": "Edinburgh",
      "postcode": "ED12 F34",
      "phoneNumber": "24681357",
      "cardName": "John Smith",
      "cardNumber": "12344321",
      "expiryMonth": "05",
      "expiryYear": "25",
      "securityCode": "555",
      "date": "2024-01-05T00:31:26.261Z",
      "isDelivery": false,
      "status": "Completed",
      "totalCost": 22.22,
      "quantities": {"1": 0},
      "id": 1
    },
    {
      "email": "nettles.holloway@imperial.ac.uk",
      "firstName": "Nettles",
      "lastName": "Holloway",
      "address": "Boat 123, Boat House District",
      "city": "London",
      "postcode": "E11 3ZZ",
      "phoneNumber": "13974268",
      "cardName": "Nettles Holloway",
      "cardNumber": "86249317",
      "expiryMonth": "01",
      "expiryYear": "21",
      "securityCode": "123",
      "date": "2024-01-05T00:38:47.946Z",
      "isDelivery": false,
      "status": "Paid",
      "totalCost": 11.11,
      "quantities": {"1": 0},
      "id": 2
    },
    {
      "email": "shrek@swamp.com",
      "firstName": "Shrek",
      "lastName": "Onions",
      "address": "1 Hut, Swamp road",
      "city": "Swampville",
      "postcode": "SSS SSS",
      "phoneNumber": "1111 2222",
      "cardName": "Shrek",
      "cardNumber": "33334444",
      "expiryMonth": "10",
      "expiryYear": "23",
      "securityCode": "777",
      "date": "2024-01-05T00:51:03.956Z",
      "isDelivery": true,
      "status": "Paid",
      "totalCost": 60.11,
      "quantities": {"1": 0},
      "id": 3
    },
    {
      "address": "The big castle up on the hill",
      "cardName": "DededeRawr",
      "cardNumber": "14569874",
      "city": "Dreamland",
      "date": "2024-01-05T01:00:04.990Z",
      "email": "dedede@hammertime.com",
      "expiryMonth": "11",
      "expiryYear": "24",
      "firstName": "Roar",
      "isDelivery": true,
      "lastName": "Dedede",
      "phoneNumber": "98989898",
      "postcode": "777 777",
      "quantities": {"1": 0},
      "securityCode": "998",
      "status": "Paid",
      "totalCost": 12.34,
      "id": 4
    },
    {
      "address": "South Kensington",
      "cardName": "Customer",
      "cardNumber": "87654321",
      "city": "London",
      "date": "2024-01-07T14:28:53.453Z",
      "email": "customer@email.com",
      "expiryMonth": "12",
      "expiryYear": "24",
      "firstName": "Dummy",
      "isDelivery": true,
      "lastName": "Customer",
      "phoneNumber": "1234567890",
      "postcode": "SW7 2AZ",
      "quantities": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0,
        "6": 0,
        "7": 0,
        "8": 0,
        "9": 0,
        "10": 0,
        "11": 0,
        "12": 0,
        "13": 0,
        "14": 0,
        "15": 0,
        "16": 0,
        "17": 0,
        "18": 0,
        "19": 0,
        "20": 0,
        "21": 0,
        "22": 0,
        "23": 0,
        "24": 0,
        "25": 0,
        "26": 0,
        "27": 0,
        "28": 0,
        "29": 0,
        "30": 0,
        "31": 0,
        "32": 0,
        "33": 0,
        "34": 0,
        "35": 0,
        "36": 0,
        "37": 0,
        "38": 0,
        "39": 0,
        "40": 0,
        "41": 0
      },
      "securityCode": "315",
      "status": "Paid",
      "totalCost": 0,
      "id": 5
    }
  ]
}